# MySQL ASSIGNHMENT

In [ ]:
Q1. What is a database? Differentiate between SQL and NoSQL databases.

In [ ]:
answer. Database is a format of data in a format that can be easily digitally accessed.
        A software which used to manage our database is called Data Base Management System.
       
        SQL : SQL stands for Structured Query Language.
              SQl databases are relational type of datases.
              In SQL data is stored in tabular format.
              These databases have fixed or static or predefined schema.
              It does'nt perform good with huge volumes of data.
              Applications such as MySQL, SQL server, Oracle, etc are used to work for
              SQL databases.  
            
      NOSQl : NOSQL stands for Not Only SQl.
              NOSQl databases are Non-relational type of datases.
              In NOSQL data is stored either key-value pair, document-based or wide-column
              stores format.
              These databases have dynamic schema.
              It  works easily with huge volumes of data.
              Applications such as MongoDB, Cassandra, Hbase etc are used to work for
              NOSQL databases.

In [ ]:
Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

In [ ]:
answer. DDL stands for Data Definition Language, and it is a subset of SQL (Structured Query
        Language) used to define and manage the structure of a database. DDL statements are
        responsible for defining, modifying, and deleting database objects such as tables,
        indexes, and constraints. The main DDL statements include CREATE, DROP, ALTER, and TRUNCATE.
        
       1. CREATE:
          The CREATE statement is used to create a new database object, such as a table, index, or view.
          Example: 
          Creating a new table named "employees" with columns for employee ID, name, and salary.
        
          CREATE TABLE employees (
          emp_id INT PRIMARY KEY,
          emp_name VARCHAR(50),
          emp_salary DECIMAL(10, 2)
           );
            
        2. DROP:
           The DROP statement is used to delete a database object, such as a table or index.
           It permanently removes the specified object and its data from the database.
           Example: 
           Dropping the "employees" table.  
        
            DROP TABLE employees;
         
        3. ALTER:
           The ALTER statement is used to modify the structure of an existing database object,
           such as adding or removing columns from a table.
           Example:
           Adding a new column "emp_department" to the "employees" table.
            
           ALTER TABLE employees
           ADD COLUMN emp_department VARCHAR(50);
            
         4. TRUNCATE:
            The TRUNCATE statement in SQL is used to quickly delete all the rows from a table,
            but it keeps the table structure for future use. It is a faster operation than 
            using the DELETE statement to remove all rows, especially when dealing with large datasets.
            
            Example:
            Truncating the "employees" table.
            
            TRUNCATE TABLE employees;

In [ ]:
Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

In [ ]:
answer. DML stands for Data Manipulation Language, and it is a subset of SQL (Structured Query Language)
        used to manage data stored in a database. DML consists of three main statements: INSERT, UPDATE,
        and DELETE.
        
       1. INSERT:
          The INSERT statement is used to add new rows of data to a table. 
          Example:
          Inserting a new employee into the "employees" table.
        
        INSERT INTO employees (emp_id, emp_name, emp_salary, emp_department)
        VALUES (1, 'John Doe', 50000, 'IT');
        
       2. UPDATE:
          The UPDATE statement is used to modify existing data in a table.
          Example:
          Updating the salary of an employee in the "employees" table. 
        
        UPDATE employees
        SET emp_salary = 55000
        WHERE emp_id = 1;
        
       3. DELETE:
          The DELETE statement is used to remove one or more rows from a table.
          Example:
          Deleting an employee from the "employees" table.
        
        DELETE FROM employees
        WHERE emp_id = 1;

In [ ]:
Q4. What is DQL? Explain SELECT with an example.

In [ ]:
answer. DQL stands for Data Query Language, and it is a subset of SQL (Structured Query
        Language) used for querying and retrieving data from a database. The primary 
        statement in DQL is SELECT, which is used to specify the columns to be retrieved
        and the conditions for selecting data.
        
        SELECT:
        The SELECT statement is used to retrieve data from one or more tables in a database.
        Example:
        Retrieving the names of all employees from the "employees" table.
        
        SELECT emp_name
        FROM employees;

In [ ]:
Q5. Explain Primary Key and Foreign Key.

In [ ]:
answer. 
     1. PRIMARY KEY:
        A Primary Key is a unique column we set in a table to easily identify and 
        locate data in queries.
        A table can have only one primary key, which should be unique and NOT NULL.
        
     2. FOREIGN KEY:
        A Foreign Key is a column used to link two or more tables together.
        A table can have any number of foreign keys, can contain duplicate and NULL values

In [ ]:
Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [ ]:
answer.The python code to connect MySQL to python is:
       
        import mysql.connector
        mydb = mysql.connector.connect(
        host="localhost",
        user="abc",
        password="password"
        )
        print(mydb)
        mycursor = mydb.cursor()
        mycursor.execute("operation")
        mydb.close()
        
        
        cursor() method:
        The cursor() method is called on the database connection object (connection).
        It returns a new cursor object, which is used to interact with the MySQL database.
        The cursor is a pointer that points to a location in the result set of a query.
        It allows you to traverse and manipulate the rows returned by a query.

        execute() method:
        The execute() method is called on the cursor object.
        It is used to execute SQL queries or commands.

In [ ]:
Q7. Give the order of execution of SQL clauses in an SQL query.

In [ ]:
answer. SELECT column(s)
        FROM table_name
        WHERE conditiob
        GROUP BY column(s)
        HAVING condition
        ORDER BY column(s) ASC/DESC